CSI API ETABS v1
cDatabaseTables.ApplyEditedTables Method
 Instructs the program to interactively import all of the tables stored in the table list using the SetTableForEditing... functions.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int ApplyEditedTables(
	bool FillImportLog,
	ref int NumFatalErrors,
	ref int NumErrorMsgs,
	ref int NumWarnMsgs,
	ref int NumInfoMsgs,
	ref string ImportLog
)
Function ApplyEditedTables (
	FillImportLog As Boolean,
	ByRef NumFatalErrors As Integer,
	ByRef NumErrorMsgs As Integer,
	ByRef NumWarnMsgs As Integer,
	ByRef NumInfoMsgs As Integer,
	ByRef ImportLog As String
) As Integer
Dim instance As cDatabaseTables
Dim FillImportLog As Boolean
Dim NumFatalErrors As Integer
Dim NumErrorMsgs As Integer
Dim NumWarnMsgs As Integer
Dim NumInfoMsgs As Integer
Dim ImportLog As String
Dim returnValue As Integer
returnValue = instance.ApplyEditedTables(FillImportLog,
	NumFatalErrors, NumErrorMsgs, NumWarnMsgs,
	NumInfoMsgs, ImportLog)
int ApplyEditedTables(
	bool FillImportLog,
	int% NumFatalErrors,
	int% NumErrorMsgs,
	int% NumWarnMsgs,
	int% NumInfoMsgs,
	String^% ImportLog
)
abstract ApplyEditedTables :
        FillImportLog : bool *
        NumFatalErrors : int byref *
        NumErrorMsgs : int byref *
        NumWarnMsgs : int byref *
        NumInfoMsgs : int byref *
        ImportLog : string byref -> int
Parameters
FillImportLog
Type: System.Boolean
 Input Item: Whether the ImportLog string should be filled. Please note that the import log may be very large.
NumFatalErrors
Type: System.Int32
 Returned Item: The number of fatal errors that occurred during the import
NumErrorMsgs
Type: System.Int32
 Returned Item: The number of error messages logged during the import
NumWarnMsgs
Type: System.Int32
 Returned Item: The number of warning messages logged during the import
NumInfoMsgs
Type: System.Int32
 Returned Item: The number of informational messages logged during the import
ImportLog
Type: System.String
 Returned Item: A string containing all messages logged during the import
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
Remarks
 If the model is locked at the time this command is called then only tables that can be interactively imported when the model is locked will be imported.
 IMPORTANT NOTE: Please save your model before calling this function. If a fatal error occurs, or this function returns nonzero, the model may be in a corrupted state and it is recommended that the user close the model without saving and reopen.
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace